# Eq

## Description
Returns TRUE if the two real numbers are equal within the tolerance.

```pascal
FUNCTION Eq(
				value1    : REAL;
				value2    : REAL;
				tolerance : REAL): BOOLEAN;
```

```python
def vs.Eq(value1, value2, tolerance):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|value1|REAL|   |
|value2|REAL|   |
|tolerance|REAL|   |

## Version
Availability: from Vectorworks 2014

## Category
* Graphic Calculation